#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Tyk/repo-policy-tyk-identity-broker/runs/run-gG7uUiMPGFFZfRCF

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.tyk-identity-broker.github_repository.repository: Refreshing state... [id=tyk-identity-broker]
module.tyk-identity-broker.github_branch.release_branches["release-1.4"]: Refreshing state... [id=tyk-identity-broker:release-1.4]
module.tyk-identity-broker.github_branch.default: Refreshing state... [id=tyk-identity-broker:master]
module.tyk-identity-broker.github_branch.release_branches["release-1.2"]: Refreshing state... [id=tyk-identity-broker:release-1.2]
module.tyk-identity-broker.github_branch.release_branches["release-1.3"]: Refreshing state... [id=tyk-identity-broker:release-1.3]
module.tyk-identity-broker.github_branch.release_branches["master"]: Refreshing state... [id=tyk-identity-broker:master]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.3"]: Refreshing state... [id=BPR_kwDOAtnrYs4B_GQn]
module.tyk-identity-broker.github_branch_protection.automerge["master"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTUzMTE5Nzc=]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.4"]: Refreshing state... [id=BPR_kwDOAtnrYs4CHTEd]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.2"]: Refreshing state... [id=BPR_kwDOAtnrYs4B_GQp]
module.tyk-identity-broker.github_branch_default.default: Refreshing state... [id=tyk-identity-broker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.tyk-identity-broker.github_branch.release_branches["release-1.2"] must be replaced
-/+ resource "github_branch" "release_branches" {
      ~ etag          = "W/\"d343e159eb6db50f4c63eae3ad24dbde4eb105cbf01c90ed4742836a47e1c814\"" -> (known after apply)
      ~ id            = "tyk-identity-broker:release-1.2" -> (known after apply)
      ~ ref           = "refs/heads/release-1.2" -> (known after apply)
      ~ sha           = "dd3a6c99506427ab18999eeffcaed52fa2804479" -> (known after apply)
      ~ source_branch = "master" -> "main" # forces replacement
      + source_sha    = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.tyk-identity-broker.github_branch.release_branches["release-1.3"] must be replaced
-/+ resource "github_branch" "release_branches" {
      ~ etag          = "W/\"11e0d50216561bb48a19fccf53119ef73dab5dd067258e225afb870ecdcb0998\"" -> (known after apply)
      ~ id            = "tyk-identity-broker:release-1.3" -> (known after apply)
      ~ ref           = "refs/heads/release-1.3" -> (known after apply)
      ~ sha           = "008a811a458c878152ee542536899c2a01ca82a7" -> (known after apply)
      ~ source_branch = "master" -> "main" # forces replacement
      + source_sha    = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.tyk-identity-broker.github_branch.release_branches["release-1.4"] must be replaced
-/+ resource "github_branch" "release_branches" {
      ~ etag          = "W/\"0a7fc3ffbb932016045db70a495ed2a0dfc8dc7db1997fc98fdc3765d7d203ee\"" -> (known after apply)
      ~ id            = "tyk-identity-broker:release-1.4" -> (known after apply)
      ~ ref           = "refs/heads/release-1.4" -> (known after apply)
      ~ sha           = "02d72dd936354d28753c9a1f5da0329ad160df38" -> (known after apply)
      ~ source_branch = "master" -> "main" # forces replacement
      + source_sha    = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.


```

</details>

*Pushed by: @mativm02, Action: `pull_request`*